# GetLoadIds Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
ElectricalAnalyticalLoadSet..::..GetLoadIds Method
ElectricalAnalyticalLoadSet Class See Also
---
Gets Equipment Load ids in the LoadSet.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2024
# Syntax
C#
---
```text
public ISet<ElementId> GetLoadIds()
```

Visual Basic
---
```text
Public Function GetLoadIds As ISet(Of ElementId)
```

Visual C++
---
```text
public:
ISet<ElementId^>^ GetLoadIds()
```

# ### Return Value
The Equipment Load ids.
# See Also
ElectricalAnalyticalLoadSet Class
Autodesk.Revit.DB.Electrical Namespace